<?php

	echo '

		需要多层判断了  现有的条件是  

		a 5分钟以下

		b 5分钟以上 30分钟以下 

		c 30分钟以上 一天以内

		d 一天以上

		其实只要有a  这个平均数就不会有大问题...

		a不等于0的时候, 

		针对 d 的计算,只要前面三个不为空

		a    b     c    d
		
		0	 1     1    1

		0    1     1    0

		0	 1     0    1

		0    1     0    0

		0    0     0    0

		0    0     1    1

		0    0     1    0

		0    0     0    0

		1	 后面不需要管了

	';

	echo '

		真阴险啊......

	';


	echo '

		            				APPID   key               value
 		格式就是前面这个 "HMSPush.10163869.Key": "kmmf1gp0ah1v7cbx0h65994eslzrfn6z",



	self.appid_huawei

    self.value_huawei

	bob.liu@juphoon.com.cn

	1234569

	';

	echo '
	
		要吸取教训啊,这种特别是循环里面的数组,一些初始化特别重要,能得到这一点还是不错的,还有就是去缓存,在改动了的js后面加上 ?1413 这种随便什么数组,可以让网页重新加载一遍网页

	';

	echo '

		现在又要开始做昨天的那个论坛的即使搜索的部分了,就是昨天的思路是先查出所有的那个

	';










